# English messages for the application

applicationTitle=Moveatis
tagRequired=Tag is required!
dialogErrorTitle=Error!
dialogWarningTitle=Warning!
tagNotFound=Tag not found!
userNotFound=User not found!
installationHelp=Moveatis is not yet fully installed.
installationLink=Click here for installation page to finish installation.
installationTitle=Moveatis installation
installationMessage=Moveatis needs to have main user, and in this page that main user \
                    is set. Someone, maybe you, should have implemented IdentityProvider interface \
                    and set up an identityservice. Below should be the buttons from identityprovider.xhtml \
                    template, which you can use to set up your account to Moveatis.
filter.forbidden=Access forbidden for unrecognized users.
countAbbreviation=ct.

# cs = category selection
cs_title=Category Selection
cs_heading=Select Categories
cs_newCategory=New Category
cs_continueToObservation=Continue to Observation
cs_errorNotUniqueCategories=Categories must be uniquely named within a category set.
cs_errorNoneSelected=At least one category must be selected to start an observation.
cs_warningEmptyCategories=Some categories are not named.
cs_categoryName=Category name
cs_categorySetName=Category set name
cs_publicCategorySets=Public category sets
cs_privateCategorySets=My category sets
cs_defaultCategorySets=Default category sets
cs_newCategorySet=New category set
cs_addCategorySet=Add
cs_addCategorySets=Add category sets 
cs_helpText=You can add, remove, and modify categories and category sets as you like. Any changes affect only this observation.
cs_timedCategory=Timed
cs_countedCategory=Counted

# obs = observation
obs_title=Observation
obs_errorCouldntSendStart=Couldn't start observation
obs_errorCouldntSendData=Couldn't send observation data to server
obs_errorKeepAliveFailed=Sending keep-alive failed
obs_start=Start
obs_continue=Play
obs_pause=Pause
obs_stop=Stop

# dlg = dialog
dlg_send=Send
dlg_save=Save
dlg_cancel=Cancel
dlg_edit=Edit
dlg_download=Download
dlg_remove=Remove
dlg_yes=Yes
dlg_no=No
dlg_saveDialogHeader=Save observation
dlg_giveEmail=Give email address
dlg_emailAddress=Email
dlg_mailOption=Send as email
dlg_saveOption=Save to application
dlg_downloadOption=Download as file
dlg_notEmpty=Please fill out this field.
dlg_onlyForRegistered=To use this feature, please login.
dlg_confirmLeave=Observation data has not been saved. Do you want to leave without saving?
dlg_confirmRemoveMessage=Removing
dlg_confirmMessage=Do you want to continue?
dlg_confirmRemoveDialog=Confirm remove

# sum = summary
sum_title=Summary
sum_totalRecordings=Recordings
sum_duration=Duration
sum_recordings=Recordings
sum_observationName=Observation name
sum_observationTarget=Observation target
sum_observationDescription=Observation description
sum_category=Category
sum_timeFrameStart=from
sum_timeFrameEnd=to
sum_timeFrameTitle=Change observation's time frame
sum_zoom=Zoom
sum_zoomOut=Zoom Out
sum_zoomIn=Zoom In
sum_total=Total
sum_begin=Begin
sum_end=End
sum_count=Count
sum_countAbr=
sum_backToTop=Back to top
sum_subject=Observation data from Moveatis
sum_message=The data you requested is attached to this mail

# head = header
head_controlPage=Control page
head_superuserPage=Superuser page
head_login=Log in
head_logout=Log out
head_info=Info
head_langSet=Language settings
head_toFrontPage=To frontpage
head_langFi=Finnish
head_langEn=English
head_backToCatEd=Edit categories
head_resetObs=Reset observation
head_userName=User name
head_password=Password
head_loginTitle=Please, log in using JYU user account

# foot = footer
foot_jyu=University of Jyv\u00e4skyl\u00e4
foot_jyuUrl=http://www.jyu.fi/en/

# inf = info
inf_whatIs=What is Moveatis?
inf_userGuide=User guide
inf_credits=Developers
inf_whatIsText=<p>Moveatis on liikuntakasvatuksen laitoksen ja tietotekniikan laitoksen yhteisty\u00f6n\u00e4 kehitetty \
               opetustapahtuman analysointisovellus. Moveatis-sovellus on seuraaja Lotas-ohjelmalle, jota on \
               k\u00e4ytetty liki 20 vuotta liikunnanopettajakoulutuksessa liikunnanopetustapahtuman analysoimisen tukena. \
               Moveatis-sovellus tukee opetustapahtuman systemaattista analysointia ja perustuu sek\u00e4 keston rekister\u00f6intiin \
               ett\u00e4 tapahtumien rekister\u00f6intiin. Sovelluksen avulla voidaan analysoida esimerkiksi, kuinka suuri osa opetustapahtumasta \
               kuluu j\u00e4rjestelyyn, kuinka suuren osan ajasta oppilas on aktiivinen tai kuinka monta kertaa opettaja antaa oppilaille \
               palautetta opetustapahtuman aikana. </p>\
               <p>Keskeist\u00e4 ohjelman k\u00e4yt\u00f6ss\u00e4 on tarkasteltavien tapahtumien tai toimintojen nime\u00e4minen. Ennen observointien suorittamista \
               on siis p\u00e4\u00e4tett\u00e4v\u00e4, mit\u00e4 tekij\u00f6it\u00e4 halutaan tapahtumassa tarkastella ja milt\u00e4 kannalta tapahtumaa halutaan analysoida. \
               Vaikka sovellus on ensisijaisesti suunniteltu liikunnan opetustapahtuman tarkkailua varten, Moveatis sopii k\u00e4ytett\u00e4v\u00e4ksi \
               my\u00f6s liikuntatuntien ulkopuolella, sill\u00e4 observoitavat kategoriat ja kategoriaryhm\u00e4t ovat vapaasti valittavissa ja k\u00e4ytt\u00e4j\u00e4 voi itse nimet\u00e4 \
               observoitavat toiminnan kategoriat. </p>\
               <p>Ennen observointien aloittamista k\u00e4ytt\u00e4j\u00e4n on kuitenkin tunnettava observoitavana olevat asiat eli \
               kategorioiden sis\u00e4ll\u00f6t mahdollisimman hyvin. T\u00e4m\u00e4 on edellytys sille, ett\u00e4 observoinnin tulokset ovat \
               luotettavia. Esimerkiksi liikunnanopettajakoulutuksessa k\u00e4ytet\u00e4\u00e4n kirjallisuuteen pohjautuvaa \
               luokitusj\u00e4rjestelm\u00e4\u00e4, jossa on kuusi opettajan toimintoa kuvaavaa kategoriaa (j\u00e4rjestelee, \
               selitt\u00e4\u00e4 teht\u00e4v\u00e4\u00e4, ohjaa suoritusta, antaa palautetta, tarkkailee, muu toiminta) ja yksi oppilaan toimintaa \
               kuvaava kategoria (oppilas suorittaa teht\u00e4v\u00e4\u00e4).</p>

inf_userGuideText=<p><h4>Kirjautuminen ja k\u00e4ytt\u00e4j\u00e4ryhm\u00e4t</h4></p> \
                  <p>Moveatis sovelluksen k\u00e4ytt\u00e4minen aloitetaan kirjautumalla ohjelmaan. K\u00e4ytt\u00e4j\u00e4ll\u00e4 on kolme kirjautumisvaihtoehtoa: \
                  avoin, JYU ja ryhm\u00e4avain. Etusivulta k\u00e4ytt\u00e4j\u00e4 voi kirjautua sovellukseen JYU-tunnuksilla, tai aloittaa sovelluksen \
                  k\u00e4yt\u00f6n joko avaimella tai ilman avainta (julkinen k\u00e4ytt\u00f6).</p>\
                  <p>- Julkinen k\u00e4ytt\u00e4j\u00e4 p\u00e4\u00e4see k\u00e4ytt\u00e4m\u00e4\u00e4n ohjelmaa ja l\u00e4hes kaikkia sen toiminnallisuuksia. K\u00e4ytt\u00e4j\u00e4 voi muokata \
                  kategorioita ja suorittaa observoinnin, mutta kategoriamuutosten ja tulosten tallennusmahdollisuuksia on rajoitettu.</p>\
                  <p>- Kirjautunut k\u00e4ytt\u00e4j\u00e4 voi tallentaa observointikategorioihin tekem\u00e4ns\u00e4 muutokset omiin tietoihinsa \
                  ja lis\u00e4ksi observoinnin raakadata ja yhteenvetodata voidaan tallentaa sovelluksen tietokantaan, jolloin tuloksiin \
                  voidaan palata my\u00f6hemmin, ja tulokset voidaan l\u00e4hgett\u00e4\u00e4 s\u00e4hk\u00f6postiin.</p>\
                  <p>- Avaimella Moveatiksen k\u00e4yt\u00f6n aloittava k\u00e4ytt\u00e4j\u00e4 saa ryhm\u00e4avaimeen liitetyt kategoriaryhm\u00e4t n\u00e4kyviin ja \
                  p\u00e4\u00e4see aloittamaan observoinnin aiemmin m\u00e4\u00e4riteltyjen kategorioiden pohjalta. Ryhm\u00e4avaimella kirjautunut k\u00e4ytt\u00e4j\u00e4 voi \
                  l\u00e4hett\u00e4\u00e4 itselleen observointitulokset sy\u00f6tt\u00e4m\u00e4\u00e4ns\u00e4 s\u00e4hk\u00f6postiosoitteeseen.</p>\
                  <p><h4>Kategoriaryhmien ja kategorioiden muokkaaminen</h4></p>\
                  <p>Kun k\u00e4ytt\u00e4j\u00e4 on avannut ohjelman ja valinnut k\u00e4ytt\u00e4j\u00e4roolinsa, niin seuraavassa vaiheessa h\u00e4n voi muokata \
                  observoitavia kategoriaryhmi\u00e4 ja kategorioita. Sek\u00e4 kategoriaryhmi\u00e4, ett\u00e4 niihin kuuluvia kategorioita voidaan \
                  lis\u00e4t\u00e4, poistaa ja nimet\u00e4 uudelleen. Lis\u00e4ksi asetuksissa on mahdollisuus m\u00e4\u00e4ritell\u00e4, mittaako kategoria \
                  tapahtuman kestoa vai tapahtumakertoja. K\u00e4ytt\u00e4j\u00e4 voi muodostaa yksitt\u00e4isist\u00e4 kategorioista kategoriaryhmi\u00e4, \
                  joista esim. yhdess\u00e4 on opettajan toimintaa kuvaavat toimintakategoriat ja toisessa oppilaan toimintaa \
                  kuvaavat kategoriat.</p>\
                  <p><h4>Observoinnin suorittaminen</h4></p> \
                  <p>Observointi aloitetaan play-painikkeesta, joka k\u00e4ynnist\u00e4\u00e4 ohjelman observointikellon. T\u00e4m\u00e4n j\u00e4lkeen observoinnin tekij\u00e4 \
                  jatkaa klikkaamalla ennalta m\u00e4\u00e4ritetyt tapahtumat alkaneeksi ja p\u00e4\u00e4ttyneeksi. Observoinnin p\u00e4\u00e4ttyess\u00e4 tarkkailija voi siirty\u00e4 \
                  yhteenvetosivulle tarkastelemaan tuloksiaan painamalla stop-painiketta.</p>\
                  <p><h4>Observoinnin yhteenveto</h4></p> \
                  <p>Yhteenvetosivulla n\u00e4kyy jokaisen kategorian kirjausten m\u00e4\u00e4r\u00e4 sek\u00e4 m\u00e4\u00e4r\u00e4n prosentuaalinen osuus kaikista \
                  kirjauksista. Lis\u00e4ksi yhteenvetosivulla n\u00e4kyy kunkin kategorian kokonaiskesto sek\u00e4 kategorian keston prosenttiosuus \
                  observoinnin kokonaiskestosta. Lis\u00e4ksi kaaviossa esitet\u00e4\u00e4n kunkin kategorian kirjatut tapahtumat aikajanalla.</p>\
                  <p>Lopuksi kirjautuneella k\u00e4ytt\u00e4j\u00e4ll\u00e4 on kaksi vaihtoehtoa tallentaa observointitulokset. Tulokset voidaan tallentaa \
                  yl\u00e4palkissa n\u00e4kyv\u00e4n tallennuskuvakkeen kautta joko sovelluksen tietokantaan tai l\u00e4hett\u00e4\u00e4 csv-muodossa \
                  sy\u00f6tt\u00e4m\u00e4\u00e4ns\u00e4 s\u00e4hk\u00f6postiosoitteeseen, jolloin ne voidaan avata my\u00f6hemmin esimerkiksi Excel-sovelluksessa.</p>

inf_creditsText=<p>Moveatis-sovellusprojekti on toteutettu Jyv\u00e4skyl\u00e4n yliopiston liikuntakasvatuksen laitoksen ja tietotekniikan laitoksen \
                yhteisty\u00f6n\u00e4. Liikuntakasvatuksen laitokselta sovelluksen kehitt\u00e4mishankkeessa ovat olleen mukana Pilvikki Heikinaro-Johansson, \
                Mirja Hirvensalo ja Nelli Lyyra. Tietotekniikan laitoksen projektiryhm\u00e4\u00e4n kuuluivat Jarmo Juuj\u00e4rvi, Sami Kallio, Kai Korhonen \
                Juha Moisio ja Ilari Paananen. Lis\u00e4ksi projektiryhm\u00e4n ty\u00f6t\u00e4 ovat ohjanneet Jukka-Pekka Santanen sek\u00e4 Mika Lehtinen.</p> \
                <p><h4>Moveatis v.1.0</h4></p>

con_title=Control
con_welcome=Welcome
con_controlMenuTitle=Own event groups and events
con_observationsTitle=Own observations
con_eventGroups=Event Groups
con_observations=Observations
con_newEventGroup=Add new event group
con_newCategorySet=Add new category set
con_newCategory=Add new category
con_newEvent=Add new event
con_newObservation=New observation
con_categorySets=Category sets
con_events=Events
con_newEventGroupDialog=Create a new event group
con_newCategorySetDialog=Create a new category set
con_newCategoryDialog=Create a new category
con_newEventDialog=Create a new event
con_editEventGroupDialog=Edit event group information
con_editEventDialog=Edit event information
con_editCategorySetDialog=Edit category set information
con_editCategoryDialog=Edit category information
con_editEventGroup=Edit event group
con_editEvent=Edit event
con_editCategorySet=Edit category set
con_editCategory=Edit category
con_eventGroupName=Event group name
con_eventGroupDescription=Event group description
con_eventGroupKeyTitle=Share with a Group key (optional)
con_eventGroupKey=key
con_eventGroupExpirationTitle=Set expiration date (optional)
con_eventGroupExpiration=dd.mm.yyyy
con_categorySetName=Category set name
con_categorySetDescription=Category set description
con_categoryName=Category name
con_categoryDescription=Category description
con_eventName=Event name
con_eventDescription=Event description
con_TIMED=Duration recording
con_COUNTED=Count recording
con_newCategoryLabel=New category

# fp = front page
fp_anonUserButton=Public user
fp_identifiedUserButton=JYU account
fp_tagUserButton=Course key
fp_infoText=<p>Moveatis. University of Jyv\u00e4skyl\u00e4, Faculty of Sport and Health Sciences.</p>\
            <p>Please choose one of the following options:</p>\
            <p>- Course key: only basic information available.</p>\
            <p>- JYU account: full functionality.</p>\
            <p>- Public user: saving your observation not available.</p>

# validation messages
validate_maxLength=Must be at least {0} characters.
validate_minLength=Must be at least {0} characters.
validate_invalidChars=Input contains invalid characters.
validate_groupKeyReserved=Group key is reserved.
