# Finnish messages for the application

tagRequired=Avain vaaditaan!
dialogErrorTitle=Virhe!
dialogWarningTitle=Varoitus!
tagNotFound=Avainta ei l\u00f6ytynyt!
userNotFound=K\u00e4ytt\u00e4j\u00e4\u00e4 ei l\u00f6ydy!
installationHelp=Moveatis ei ole viel\u00e4 t\u00e4ysin asennettu.
installationLink=Klikkaa t\u00e4st\u00e4 siirty\u00e4ksesi asennussivulle ja viimeistele asennus ohjeiden mukaan
installationTitle=Moveatiksen asennus
installationMessage=Moveatis tarvitsee ainakin yhden p\u00e4\u00e4k\u00e4ytt\u00e4j\u00e4n, ja t\u00e4ll\u00e4 sivulla tuo p\u00e4\u00e4k\u00e4ytt\u00e4j\u00e4 asetetaan. \
                    Joku, ehk\u00e4p\u00e4 juuri sin\u00e4, on toteuttanut IdentityProvider-liittym\u00e4n \
                    ja j\u00e4rjest\u00e4nyt tunnistautumispalvelun. Alapuolella pit\u00e4isi olla painikkeet identityprovider.xhtml \
                    -tiedostosta, joita voit k\u00e4ytt\u00e4\u00e4 perustaessasi tilin Moveatikseen.

countAbbreviation=kpl

# cs = category selection
cs_title=Kategorioiden valinta
cs_heading=Valitse kategoriat
cs_newCategory=Uusi kategoria
cs_continueToObservation=Jatka observointiin
cs_errorNotUniqueCategories=Kategoriaryhm\u00e4 ei saa sis\u00e4lt\u00e4\u00e4 useita saman nimisi\u00e4 kategorioita.
cs_errorNoneSelected=V\u00e4hint\u00e4\u00e4n yksi kategoria pit\u00e4\u00e4 valita, jotta observointi voidaan aloittaa.
cs_warningEmptyCategories=Osa kategorioista on nime\u00e4m\u00e4tt\u00e4.
cs_categoryName=Kategorian nimi
cs_publicCategorySets=Julkiset kategoriaryhm\u00e4t
cs_privateCategorySets=Omat kategoriaryhm\u00e4t
cs_addCategorySet=Lis\u00e4\u00e4
cs_addCategorySets=Lis\u00e4\u00e4 kategoriaryhmi\u00e4
cs_helpText=Voit poistaa kategoriaryhm\u00e4n tai yksitt\u00e4isi\u00e4 kategorioita observaatiosta
cs_eventGroupAndEventName=Tapahtumaryhm\u00e4n nimi on {0} ja tapahtuman nimi on {1}.
cs_publicEventGroups=Julkiset tapahtumaryhm\u00e4t
cs_publicEvents=Julkiset tapahtumat
cs_select=Valitse

# obs = observation
obs_title=Observointi
obs_errorCouldntSendStart=Observoinnin aloitus ep\u00e4onnistui
obs_errorCouldntSendData=Observointidatan l\u00e4hetys palvelimelle ep\u00e4onnistui
obs_errorKeepAliveFailed=Keep-alive viestin l\u00e4hetys ep\u00e4onnistui

# dlg = dialog
dlg_send=L\u00e4het\u00e4
dlg_save=Tallenna
dlg_cancel=Peruuta
dlg_edit=Muokkaa
dlg_download=Lataa
dlg_remove=Poista
dlg_yes=Kyll\u00e4
dlg_no=Ei
dlg_saveDialogHeader=Tallenna observointi
dlg_giveEmail=Anna s\u00e4hk\u00f6postiosoite
dlg_emailAddress=S\u00e4hk\u00f6posti
dlg_mailOption=L\u00e4het\u00e4 s\u00e4hk\u00f6postiin
dlg_saveOption=Tallenna sovellukseen
dlg_downloadOption=Lataa tiedostona
dlg_notEmpty=Ei saa olla tyhj\u00e4.
dlg_onlyForRegistered=Toiminto on saatavilla vain kirjautuneille k\u00e4ytt\u00e4jille.
dlg_confirmLeave=Et ole tallentanut observointia. Haluatko poistua tallentamatta ensin?
dlg_confirmRemoveMessage=Poistetaan
dlg_confirmMessage=Haluatko jatkaa?
dlg_confirmRemoveDialog=Vahvista poisto

# sum = summary
sum_title=Yhteenveto
sum_totalRecordings=Kirjausta
sum_duration=Kesto
sum_recordings=Kirjaukset
sum_observationName=Observoinnin nimi
sum_observationTarget=Observoinnin kohde
sum_observationDescription=Observoinnin kuvaus
sum_category=Kategoria
sum_timeFrameStart=Aloitusaika
sum_timeFrameEnd=Lopetusaika
sum_timeFrameTitle=Muuta observoinnin aikav\u00e4li\u00e4
sum_zoom=Suurennus
sum_zoomOut=Pienenn\u00e4
sum_zoomIn=Suurenna
sum_total=Yhteens\u00e4
sum_begin=Aloitus
sum_end=Lopetus
sum_count=M\u00e4\u00e4r\u00e4
sum_countAbr=kpl
sum_backToTop=Takaisin yl\u00f6s

# head = header
head_controlPage=Hallintasivu
head_superuserPage=P\u00e4\u00e4k\u00e4ytt\u00e4j\u00e4sivu
head_login=Kirjaudu sis\u00e4\u00e4n
head_logout=Kirjaudu ulos
head_info=Info
head_langSet=Kieliasetus
head_toFrontPage=Etusivulle
head_langFi=suomi
head_langEn=englanti
head_backToCatEd=Muokkaa kategorioita
head_resetObs=Tyhjenn\u00e4 observointi
head_userName=K\u00e4ytt\u00e4j\u00e4tunnus
head_password=Salasana
head_loginTitle=Kirjaudu sis\u00e4\u00e4n JYU-k\u00e4ytt\u00e4j\u00e4tunnuksella

# foot = footer
foot_jyu=Jyv\u00e4skyl\u00e4n Yliopisto
foot_jyuUrl=http://www.jyu.fi/


# inf = info
inf_whatIs=Mik\u00e4 on Moveatis?
inf_userGuide=K\u00e4ytt\u00f6ohjeet
inf_credits=Toteuttajatiimi
inf_whatIsText=<p>Moveatis on liikuntakasvatuksen laitoksen ja tietoj\u00e4rjestelm\u00e4tieteiden laitoksen yhteisty\u00f6n\u00e4 kehitetty \
               opetustapahtuman analysointisovellus. Moveatis-sovellus on kehitetty Lotas-ohjelman pohjalta, jota on \
               k\u00e4ytetty liki 20 vuotta liikunnanopettajakoulutuksessa liikunnanopetustapahtuman analysoimisen tukena. \
               Moveatis-sovellus tukee opetustapahtuman systemaattista analysointia ja perustuu sek\u00e4 keston rekister\u00f6intiin \
               ett\u00e4 tapahtumien rekister\u00f6intiin. Sovelluksen avulla voidaan analysoida esimerkiksi kuinka suuri osa opetustapahtumasta \
               kuluu j\u00e4rjestelyyn, kuinka suuren osan ajasta oppilas on aktiivinen tai kuinka monta kertaa opettaja antaa oppilaille \
               palautetta opetustapahtuman aikana. </p>\
               <p>Keskeist\u00e4 ohjelman k\u00e4yt\u00f6ss\u00e4 on tarkasteltavien tapahtumien tai toimintojen nime\u00e4minen. Ennen observointien suorittamista \
               on siis p\u00e4\u00e4tett\u00e4v\u00e4, mit\u00e4 tekij\u00f6it\u00e4 halutaan tapahtumassa tarkastella ja milt\u00e4 kannalta tapahtumaa halutaan analysoida. \
               Vaikka sovellus on ensisijaisesti suunniteltu liikunnan opetustapahtuman tarkkailua varten, Moveatis sopii k\u00e4ytett\u00e4v\u00e4ksi \
               my\u00f6s liikuntatuntien ulkopuolella, sill\u00e4 observoitavat luokat ovat vapaasti muokattavissa ja k\u00e4ytt\u00e4j\u00e4 voi itse nimet\u00e4 \
               observoitavat toiminnan kategoriat. </p>\
               <p>Oletuksena ohjelmassa on liikunnanopettajakoulutuksessa k\u00e4ytetty luokitusj\u00e4rjestelm\u00e4, johon kuuluu kuusi opettajan \
               toimintoa (j\u00e4rjestelee, selitt\u00e4\u00e4 teht\u00e4v\u00e4\u00e4, ohjaa suoritusta, antaa palautetta, tarkkailee, muu toiminta) ja yksi oppilaan \
               toiminta kategoria (oppilas suorittaa teht\u00e4v\u00e4\u00e4). T\u00e4m\u00e4n kirjallisuuteen ja tutkimuksiin perustuvan luokitusj\u00e4rjestelm\u00e4n on \
               todettu kuvaavan kattavasti opettajan toimintaa liikunnanopetustapahtuman aikana. Ennen observointien aloittamista \
               k\u00e4ytt\u00e4j\u00e4n on kuitenkin tunnettava observoitavana olevat asiat eli kategorioiden sis\u00e4ll\u00f6t mahdollisimman hyvin. T\u00e4m\u00e4 on \
               edellytys sille, ett\u00e4 observoinneista voidaan saada luotettavia.</p>

inf_userGuideText=<p>Moveatis sovelluksen k\u00e4ytt\u00e4minen aloitetaan kirjautumalla ohjelmaan. K\u00e4ytt\u00e4j\u00e4ll\u00e4 on kolme kirjautumisvaihtoehtoa: \
                  avoin, JYU ja kurssiavain. </p>\
                  <p>- Avoin k\u00e4ytt\u00e4j\u00e4 p\u00e4\u00e4see k\u00e4ytt\u00e4m\u00e4\u00e4n ohjelmaa ja l\u00e4hes kaikkia sen toiminnallisuuksia. Avoin k\u00e4ytt\u00e4j\u00e4 voi muokata \
                  kategorioita ja suorittaa observoinnin, mutta tallennusmahdollisuuksia on rajoitettu: kategorioihin tehtyj\u00e4 muutoksia \
                  ei voi tallentaa, eik\u00e4 Avoin k\u00e4ytt\u00e4j\u00e4 saa tallennettua observointejaan Moveatis-tietokantaan tai l\u00e4hetetty\u00e4 \
                  analysointituloksiaan s-postiin.</p>\
                  <p>- JYU-tunnuksilla kirjautuva k\u00e4ytt\u00e4j\u00e4 voi tallentaa observointikategorioihin tekem\u00e4ns\u00e4 muutokset omiin tietoihinsa \
                  ja lis\u00e4ksi observoinnin raakadata ja yhteenvetodata voidaan tallentaa Moveatis-tietokantaan. JYU-k\u00e4ytt\u00e4j\u00e4 voi my\u00f6s \
                  l\u00e4hett\u00e4\u00e4 observointitulokset s\u00e4hk\u00f6postiinsa. JYU k\u00e4ytt\u00e4j\u00e4 p\u00e4\u00e4see tarkastelemaan my\u00f6hemmin tekemi\u00e4\u00e4n observointeja, \
                  jotka on tallennettu Moveatis-tietokantaan.</p>\
                  <p>- Kurssiavaimella Moveatiksen k\u00e4yt\u00f6n aloittava k\u00e4ytt\u00e4j\u00e4 saa kurssiavaimeen tallennetut kategoriaryhm\u00e4t n\u00e4kyviin ja \
                  p\u00e4\u00e4see aloittamaan observoinnin aiemmin m\u00e4\u00e4riteltyjen kategorioiden pohjalta. Kurssiavaimella kirjautunut k\u00e4ytt\u00e4j\u00e4 voi \
                  l\u00e4hett\u00e4\u00e4 itselleen observointitulokset s\u00e4hk\u00f6postiin.</p>\
                  <p>Kun k\u00e4ytt\u00e4j\u00e4 on avannut ohjelman ja valinnut k\u00e4ytt\u00e4j\u00e4statuksensa, niin seuraavassa vaiheessa h\u00e4n voi muokata \
                  observoitavia kategorioita. Kategorioita voidaan lis\u00e4t\u00e4, poistaa ja nimet\u00e4 uudelleen. Lis\u00e4ksi asetuksissa on \
                  mahdollisuus m\u00e4\u00e4ritell\u00e4, mittaako kategoria tapahtuman kestoa vai tapahtumakertoja. K\u00e4ytt\u00e4j\u00e4 voi muodostaa \
                  yksitt\u00e4isist\u00e4 kategorioista kategoriaryhmi\u00e4, joista esim. yhdess\u00e4 on opettajan toimintaa kuvaavat toimintakategoriat \
                  ja toisessa oppilaan toimintaa kuvaavat kategoriat.</p>\
                  <p>Observointi aloitetaan play-painikkeesta, mik\u00e4 k\u00e4ynnist\u00e4\u00e4 ohjelman master-kellon. T\u00e4m\u00e4n j\u00e4lkeen observoinnin tekij\u00e4 \
                  kirjaa tapahtumat ennalta m\u00e4\u00e4riteltyjen kategorioiden mukaan. Observoinnin p\u00e4\u00e4ttyess\u00e4 tarkkailija voi siirty\u00e4 \
                  yhteenvetosivulle, tarkastelemaan tuloksiaan painamalla stop-painiketta.</p>\
                  <p>Yhteenvetosivulla n\u00e4kyy jokaisen kategorian kirjausten m\u00e4\u00e4r\u00e4 sek\u00e4 m\u00e4\u00e4r\u00e4n prosentuaalinen osuus kaikista \
                  kirjauksista. Lis\u00e4ksi yhteenvetosivulla n\u00e4kyy kunkin kategorian kokonaiskesto sek\u00e4 kategorian keston prosenttiosuus \
                  observoinnin kokonaiskestosta. Yhteenvetosivulla on my\u00f6s Gantt-kaavio, miss\u00e4 n\u00e4kyy kunkin kategorian mukainen tapahtuma \
                  aikajanalla.</p>\
                  <p>Lopuksi k\u00e4ytt\u00e4j\u00e4ll\u00e4 on valittavanaan kaksi vaihtoehtoa (mik\u00e4li on JYU-k\u00e4ytt\u00e4j\u00e4), joiden kautta tuloksia voidaan \
                  tallentaa. Analysointitulokset voidaan tallentaa yl\u00e4palkissa n\u00e4kyv\u00e4n tallenna-kuvakkeen kautta joko moveatis-tietokantaan \
                  tai l\u00e4hett\u00e4\u00e4 csv-muodossa omaan s\u00e4hk\u00f6postiin, jolloin ne voidaan avata my\u00f6hemmin esimerkiksi excel-sovelluksessa.</p>

inf_creditsText=<p>Moveatis-sovellusprojekti on toteutettu Jyv\u00e4skyl\u00e4n yliopiston liikuntakasvatuksen laitoksen ja tietotekniikan laitoksen \
                yhteisty\u00f6n\u00e4. Liikuntakasvatuksen laitokselta sovelluksen kehitt\u00e4mishankkeessa ovat olleen mukana Pilvikki Heikinaro-Johansson, \
                Mirja Hirvensalo ja Nelli Lyyra. Tietotekniikan laitoksen projektiryhm\u00e4\u00e4n kuuluivat Jarmo Juuj\u00e4rvi, Sami Kallio, Kai Korhonen \
                Juha Moisio ja Ilari Paananen. Lis\u00e4ksi projektiryhm\u00e4n ty\u00f6t\u00e4 ovat ohjanneet Jukka-Pekka Santanen sek\u00e4 Mika Lehtinen.</p> \
                <p><h4>Moveatis - k\u00e4ytt\u00e4j\u00e4n opas</h4></p>\
                <p>Nelli Lyyra, Pilvikki Heikinaro-Johansson & Mirja Hirvensalo</p>

con_welcome=Tervetuloa
con_controlMenuTitle=Omat tapahtumaryhm\u00e4t ja tapahtumat
con_observationsTitle=Suoritetut observaatiot
con_eventGroups=Tapahtumaryhm\u00e4t
con_observations=Observoinnit
con_newEventGroup=Luo uusi tapahtumaryhm\u00e4
con_newEvent=Lis\u00e4\u00e4 uusi tapahtuma
con_newCategorySet=Lis\u00e4\u00e4 uusi kategoriaryhm\u00e4
con_newCategory=Lis\u00e4\u00e4 uusi kategoria
con_newObservation=Aloita observointi
con_categorySets=Kategoriaryhm\u00e4t
con_events=Tapahtumat
con_newEventGroupDialog=Luo uusi tapahtumaryhm\u00e4
con_newCategorySetDialog=Luo uusi kategoriaryhm\u00e4
con_newCategoryDialog=Luo uusi kategoria
con_newEventDialog=Luo uusi tapahtuma
con_editEventGroupDialog=Muokkaa tapahtumaryhm\u00e4n tietoja
con_editEventDialog=Muokkaa tapahtuman tietoja
con_editCategorySetDialog=Muokkaa kategoriaryhm\u00e4n tietoja
con_editCategoryDialog=Muokkaa kategorian tietoja
con_editEventGroup=Muokkaa tapahtumaryhm\u00e4\u00e4
con_editEvent=Muokkaa tapahtumaa
con_editCategorySet=Muokkaa kategoriaryhm\u00e4\u00e4
con_editCategory=Muokkaa kategoriaa
con_eventGroupName=Tapahtumaryhm\u00e4n nimi
con_eventGroupDescription=Tapahtumaryhm\u00e4n kuvaus
con_eventGroupKeyTitle=Jaa tapahtumaryhm\u00e4 ryhm\u00e4avaimella (valinnainen)
con_eventGroupKey=Avain
con_eventGroupExpirationTitle=Aseta vanhenemisp\u00e4iv\u00e4 (valinnainen)
con_eventGroupExpiration=pp.kk.vvvv
con_categorySetName=Kategoriaryhm\u00e4n nimi
con_categorySetDescription=Kategoriaryhm\u00e4n kuvaus
con_categoryName=Kategorian nimi
con_categoryDescription=Kategorian kuvaus
con_eventName=Tapahtuman nimi
con_eventDescription=Tapahtuman kuvaus

# fp = front page
fp_anonUserButton=Julkinen
fp_identifiedUserButton=JYU-tunnukset
fp_tagUserButton=Kurssiavain

# validation messages
validate_lengthExceeded=Suurin sallittu pituus on {0} merkki\u00e4.
